tap "audiofilter/spuc"
tap "dracula/install"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "nlohmann/json"
tap "pothosware/pothos"
tap "romkatv/powerlevel10k"
tap "rxseger/hackrf"
tap "symfony-cli/tap"
# Driver and tools for a software-defined radio
brew "airspy"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Cross-platform make
brew "cmake"
# Graphics library to dynamically manipulate images
brew "gd"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Isolated development environments using Docker
brew "docker-compose"
# Use Realtek DVB-T dongles as a cheap SDR
brew "librtlsdr"
# ADS-B Ground Station System for RTL-SDR
brew "dump1090-mutability"
# Make creating custom firmwares for ESP32/ESP8266 super easy
brew "esphome"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# SoapySDR RTL-SDR Support Module
brew "soapyrtlsdr"
# SDK for signal processing blocks to implement software radios
brew "gnuradio"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Low cost software radio platform
brew "hackrf"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# USB 3.0 Superspeed Software Defined Radio Source
brew "libbladerf"
# Web and API based SMTP testing tool
brew "mailhog", restart_service: :changed
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Fast, highly customisable system info script
brew "neofetch"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Libraries for security-enabled client and server applications
brew "nss"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Theme for zsh
brew "powerlevel10k"
# Python version management
brew "pyenv"
# Generic machine emulator and virtualizer
brew "qemu"
# Soak up standard input and write to a file
brew "sponge"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Lime suite device drivers, GUI, and SDR support
brew "pothosware/pothos/limesuite"
# Soapy SDR plugins for Airspy
brew "pothosware/pothos/soapyairspy"
# Soapy SDR plugin for Blade RF
brew "pothosware/pothos/soapybladerf"
# Soapy SDR plugin for Hack RF
brew "pothosware/pothos/soapyhackrf"
# Use any Soapy SDR remotely
brew "pothosware/pothos/soapyremote"
# Soapy SDR plugin for Skylark Iris Module
brew "pothosware/pothos/soapyiris"
# Soapy SDR plugin for PlutoSDR.
brew "pothosware/pothos/soapyplutosdr"
# Soapy SDR plugin for Red Pitaya
brew "pothosware/pothos/soapyredpitaya"
# Symfony CLI helps Symfony developers manage projects, from local code to remote infrastructure
brew "symfony-cli/tap/symfony-cli"
# App to build and share containerised applications and microservices
cask "docker"
# Dark theme for Steam
cask "dracula-steam"
# Dark theme for Terminal.app
cask "dracula-terminal"
# Software-defined radio receiver powered by GNU Radio and Qt
cask "gqrx"
# Interface for reading and syncing eBooks
cask "kindle"
